import { glob, path, fs } from 'zx'
import { format } from 'prettier'

const replaces: [string | RegExp, string][] = [
  // 替换单引号为双引号
  [/"(.*?)"/g, '“$1”'],
  [/'(.*?)'/g, '‘$1’'],
  ['"‘', '“‘'],
  ['’"', '’”'],
  // 替换斜体为粗体
  [/(?<!\*)\*(?!\*)(.+?)(?<!\*)\*(?!\*)/g, '**$1**'],
  // 替换 - 为中文的 ——
  [/([\u4e00-\u9fa5]+?)-([\u4e00-\u9fa5”]+?)/g, '$1—$2'],
  [/([\u4e00-\u9fa5\*]+?)-([\u4e00-\u9fa5”\*]+?)/g, '$1—$2'],
  [/([\u4e00-\u9fa5\*]+?) ?- ?([\u4e00-\u9fa5”\*]+?)/g, '$1—$2'],
  [/([\u4e00-\u9fa5？]+?)--([\u4e00-\u9fa5”]+?)/g, '$1——$2'],
  [/([\u4e00-\u9fa5？]+?) --([\u4e00-\u9fa5”]+?)/g, '$1——$2'],
  ['-”', '—”'],
  [/([\u4e00-\u9fa5]+?)-$/gm, '$1—'],
  [/^-([\u4e00-\u9fa5]+?)/gm, '—$1'],
  [/^- ?([\u4e00-\u9fa5]+?) ?-$/gm, '—$1—'],
  // 替换英文 , 为中文的，
  [',', '，'],
  [/([\u4e00-\u9fa5]+?)!/g, '$1！'],
  [/([\u4e00-\u9fa5]+?);/g, '$1；'],
  [/([\u4e00-\u9fa5]+?)\?/g, '$1？'],
  [/([\u4e00-\u9fa5]+?):( ?)/g, '$1：'],
  // 替换中文的数字为阿拉伯数字，例如 １．１ 为 1.1
  ['１', '1'],
  ['２', '2'],
  ['３', '3'],
  ['４', '4'],
  ['５', '5'],
  ['６', '6'],
  ['７', '7'],
  ['８', '8'],
  ['９', '9'],
  ['０', '0'],
  ['．', '.'],
  // 替换人名
  ['军械大师', '武器大师'],
  ['兵器大师', '武器大师'],
  ['军械长', '武器大师'],
  ['麦迪森·克莱门斯', '麦迪森・克莱门茨'],
  ['假面', '披风'],
  ['鬼李', '李鬼'],
  ['格鲁', '暗魇'],
  ['警卫', '监护者'],
  ['战栗', '暗魇'],
  [/([\u4e00-\u9fa5]+?)·([\u4e00-\u9fa5]+?)/g, '$1・$2'],
]

for (const it of await glob('./books/**/*.md')) {
  console.log(it)
  const fsPath = path.resolve(it)
  const r = replaces.reduce(
    (acc, [reg, rep]) => acc.replaceAll(reg, rep),
    await fs.readFile(fsPath, 'utf-8'),
  )
  await fs.writeFile(fsPath, await format(r, { parser: 'markdown' }))
}
